#include "main.h"

int main() {
	system("chcp 1251");
	system("cls");
	setlocale(0, "");

	fstream file_1("mums_data.txt", ios::out);
	fstream file_2("dads_data.txt", ios::out);
	string str = "";


	file_1 << 18 << '\n';
	file_1 << "Ковальчук Софья Викторовна" << '\n';

	file_1 << 39 << '\n';
	file_1 << "Мея Елена Васильевна" << '\n';

	file_1 << 63 << '\n';
	file_1 << "Мурашко Светлана Степановна" << '\n';

	file_1 << 16 << '\n';
	file_1 << "Бородейко Яна Максимовна" << '\n';

	file_1 << 56 << '\n';
	file_1 << "Виноградова Юлия Николаевна" << '\n';

	file_1.close();		/*Сохраянем изменения*/

	file_1.open("mums_data.txt");


	/*Проверяем, записались ли данные в файл*/
	cout << "\t\tСодержимое файла #1:\n\n";
	if (file_1.is_open()) {
		while (file_1) {		//Пока есть что-то, что можно прочитать в файле	
			getline(file_1, str);		//Записываем первую строку в str и сразу же выводим её
			cout << str << '\n';
		}

		file_1.close();		/*Сохраянем изменения*/

		cout << "\n\tФайл с данными по умолчанию успешно создан!\n\n\n";	/*Выводим пользователю, что все хорошо :)*/
	}
	else { cout << "\tНе удалось открыть файл!\n"; }


	file_2 << 18 << '\n';
	file_2 << "Дмитриев Артур Александрович" << '\n';

	file_2 << 49 << '\n';
	file_2 << "Мея Александр Николаевич" << '\n';

	file_2 << 63 << '\n';
	file_2 << "Мурашко Василий Сергеевич" << '\n';

	file_2 << 18 << '\n';
	file_2 << "Кондратьев Дмитрий Павлович" << '\n';

	file_2 << 60 << '\n';
	file_2 << "Виноградов Николай Романович" << '\n';

	file_2.close();		/*Сохраянем изменения*/

	file_2.open("dads_data.txt");


	/*Проверяем, записались ли данные в файл*/
	cout << "\t\tСодержимое файла #2:\n\n";
	if (file_2.is_open()) {
		while (file_2) {		//Пока есть что-то, что можно прочитать в файле	
			getline(file_2, str);		//Записываем первую строку в str и сразу же выводим её
			cout << str << '\n';
		}

		file_2.close();		/*Сохраянем изменения*/

		cout << "\n\tФайл с данными по умолчанию успешно создан!\n\n\n";	/*Выводим пользователю, что все хорошо :)*/
	}
	else { cout << "\tНе удалось открыть файл!\n"; }

	system("pause");

	return 0;
}